In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [2]:
df_2018 = pd.read_csv('2018.csv', index_col=0)

In [3]:
df_2018.head()

,code,dia,cd,hoa,khtn,khxh,su,anh,van,sinh,toan,li,city
NaN,18010226,6.50,8.25,NaN,NaN,5.92,3.0,3.0,3.75,NaN,3.0,NaN,18
NaN,18010229,9.00,8.25,NaN,NaN,7.75,6.0,9.0,7.50,NaN,8.8,NaN,18
NaN,18010232,NaN,NaN,5.5,5.42,NaN,NaN,4.0,5.50,5.0,6.0,5.75,18
NaN,18010242,4.75,7.25,NaN,NaN,5.17,3.5,2.6,5.75,NaN,3.4,NaN,18
NaN,18010247,6.25,8.00,NaN,NaN,5.92,3.5,3.0,6.75,NaN,3.8,NaN,18

In [4]:
df_2018 = df_2018.fillna(-1)
df_2018.head()

,code,dia,cd,hoa,khtn,khxh,su,anh,van,sinh,toan,li,city
NaN,18010226,6.50,8.25,-1.0,-1.00,5.92,3.0,3.0,3.75,-1.0,3.0,-1.00,18
NaN,18010229,9.00,8.25,-1.0,-1.00,7.75,6.0,9.0,7.50,-1.0,8.8,-1.00,18
NaN,18010232,-1.00,-1.00,5.5,5.42,-1.00,-1.0,4.0,5.50,5.0,6.0,5.75,18
NaN,18010242,4.75,7.25,-1.0,-1.00,5.17,3.5,2.6,5.75,-1.0,3.4,-1.00,18
NaN,18010247,6.25,8.00,-1.0,-1.00,5.92,3.5,3.0,6.75,-1.0,3.8,-1.00,18

### Fill missing value by -1

In [5]:
df_2018.isnull().sum()

code    0
dia     0
cd      0
hoa     0
khtn    0
khxh    0
su      0
anh     0
van     0
sinh    0
toan    0
li      0
city    0
dtype: int64

In [6]:
df_2018.index

Float64Index([nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
              ...
              nan, nan, nan, nan, nan, nan, nan, nan, nan, nan],
             dtype='float64', length=744396)

In [7]:
df_2018.reset_index(drop=True, inplace=True)

In [8]:
df_2018.index

RangeIndex(start=0, stop=744396, step=1)

In [9]:
df_2018.head()

,code,dia,cd,hoa,khtn,khxh,su,anh,van,sinh,toan,li,city
0,18010226,6.50,8.25,-1.0,-1.00,5.92,3.0,3.0,3.75,-1.0,3.0,-1.00,18
1,18010229,9.00,8.25,-1.0,-1.00,7.75,6.0,9.0,7.50,-1.0,8.8,-1.00,18
2,18010232,-1.00,-1.00,5.5,5.42,-1.00,-1.0,4.0,5.50,5.0,6.0,5.75,18
3,18010242,4.75,7.25,-1.0,-1.00,5.17,3.5,2.6,5.75,-1.0,3.4,-1.00,18
4,18010247,6.25,8.00,-1.0,-1.00,5.92,3.5,3.0,6.75,-1.0,3.8,-1.00,18

In [10]:
df_2018.describe()

,code,dia,cd,hoa,khtn,khxh,su,anh,van,sinh,toan,li,city
count,7.443960e+05,744396.000000,744396.000000,744396.000000,744396.000000,744396.000000,744396.000000,744396.000000,744396.000000,744396.000000,744396.000000,744396.000000,744396.000000
mean,3.033333e+07,2.773242,3.153646,1.575974,1.441845,2.318065,1.879868,3.374189,5.304883,1.387712,4.857508,1.589435,30.321701
std,1.905104e+07,3.338659,4.171936,3.080730,2.945587,3.336120,2.543337,2.150915,1.711387,2.870951,1.490691,3.122375,19.057832
min,1.000019e+06,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,1.000000
25%,1.500588e+07,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,2.600000,4.500000,-1.000000,3.800000,-1.000000,15.000000
50%,3.200454e+07,4.250000,4.250000,-1.000000,-1.000000,3.500000,2.750000,3.400000,5.500000,-1.000000,5.000000,-1.000000,32.000000
75%,4.700776e+07,5.750000,7.250000,4.500000,4.500000,5.500000,4.000000,4.400000,6.500000,4.250000,6.000000,4.500000,47.000000
max,6.400622e+07,10.000000,10.000000,10.000000,9.330000,9.580000,10.000000,10.000000,9.750000,10.000000,10.000000,10.000000,64.000000

In [11]:
top100_toan = df_2018.sort_values(by = 'toan',ascending=False).head(100)

In [12]:
df = top100_toan.groupby(['city'])['toan'].value_counts().groupby(['city']).sum().sort_values(ascending= False)

In [13]:
df

city
1     11
5     11
2     10
15     7
23     7
22     5
26     5
28     4
21     3
4      3
10     3
19     3
62     3
33     3
57     2
18     2
16     2
32     2
39     2
56     2
27     1
7      1
3      1
40     1
55     1
9      1
35     1
50     1
60     1
53     1
Name: toan, dtype: int64